Lyyyyb/Keil-Project/stm32 project/3-14 HEX数据包/User/main.c
#include "stm32f10x.h"                  // Device header
#include "Delay.h"
#include "OLED.h"
#include "LED.h"
#include "Key.h"
#include "Count.h"
#include "Timer.h"
#include "PWM.h"
#include "IC.h"
#include "AD.h"
#include "MyDMA.h"
#include "Serial.h"

uint16_t Num;
uint8_t KeyNum;
uint8_t RxData;

extern uint8_t Serial_TxPacket[];
extern uint8_t Serial_RxPacket[];

int main(void)
{
    
    OLED_Init();
    Key_Init();
    Serial_Init();
    
    OLED_ShowString(1,1,"TxPacket");
    OLED_ShowString(3,1,"TxPacket");
    Serial_TxPacket[0]=0x01;
    Serial_TxPacket[1]=0x02;
    Serial_TxPacket[2]=0x03;
    Serial_TxPacket[3]=0x04;
    
    



    while(1)
    {
        KeyNum = Key_GetNum();
        if(KeyNum==1)
        {
            Serial_TxPacket[0]++;
            Serial_TxPacket[1]++;
            Serial_TxPacket[2]++;
            Serial_TxPacket[3]++;
            Serial_SendPacket();
            OLED_ShowHexNum(2,1,Serial_TxPacket[0],2);
            OLED_ShowHexNum(2,4,Serial_TxPacket[1],2);
            OLED_ShowHexNum(2,7,Serial_TxPacket[2],2);
            OLED_ShowHexNum(2,10,Serial_TxPacket[3],2);
        }
        
        if(Serial_GetRxFlag()==1)//判断是否接收到了数据包
        {
            OLED_ShowHexNum(4,1,Serial_RxPacket[0],2);
            OLED_ShowHexNum(4,4,Serial_RxPacket[1],2);
            OLED_ShowHexNum(4,7,Serial_RxPacket[2],2);
            OLED_ShowHexNum(4,10,Serial_RxPacket[3],2);
                            
        }
    }

     
    
}

